"%@ days ago" = "%@ dagen geleden";
"Autocomplete" = "Auto-afmaken";
"Blog" = "Blog";
"Close all" = "Sluit alles";
"Ecosia recommends" = "Ecosia raadt aan";
"Ecosia won’t remember the pages you visited, your search history or your autofill information once you close a tab. Your searches still contribute to trees." = "Zodra u een tabblad sluit, vergeet Ecosia de pagina's die u heeft bezocht, uw zoekgeschiedenis of uw automatisch ingevulde gegevens. Uw zoekopdrachten dragen nog steeds bij aan het planten van bomen.";
"Explore Ecosia" = "Ontdek Ecosia";
"FAQ" = "Veelgestelde vragen";
"Financial reports" = "Financiële verslagen";
"Force Dark Mode" = "Donkere Modus forceren";
"Get started" = "Beginnen";
"How Ecosia works" = "Hoe Ecosia werkt";
"Invert website colors" = "Websitekleuren omkeren";
"Keep up to date with the latest news from our projects and more" = "Blijf op de hoogte van het laatste nieuws over onze projecten en meer";
"Moderate" = "Gematigd";
"More" = "Meer";
"My searches" = "Mijn zoekopdrachten";
"New" = "Nieuw";
"Off" = "Uit";
"Private" = "Privé";
"Personalized results" = "Gepersonaliseerde resultaten";
"Plant trees while you browse the web" = "Plant bomen terwijl je op internet surft";
"Privacy" = "Privacy";
"Relevant results based on past searches" = "Relevante resultaten op basis van vorige zoekopdrachten";
"Safe search" = "Veilig zoeken";
"Search" = "Zoeken";
"Search the web to plant trees..." = "Doorzoek het web en plant bomen...";
"Search region" = "Zoekregio";
"Send feedback" = "Verstuur feedback";
"Shop" = "Winkel";
"Shown under the search field" = "Onder het zoekveld";
"Start using these green companies to plant more trees and become more sustainable" = "Begin deze groene ondernemingen te gebruiken om meer bomen te planten en duurzamer te worden";
"Stories" = "Nieuws";
"Strict" = "Strikt";
"TREES" = "Bomen";
"TREES PLANTED WITH ECOSIA" = "Bomen geplant met Ecosia";
"Terms and conditions" = "Algemene voorwaarden";
"Version %@" = "Versie %@";
"We use the profit from your searches to plant trees where they are needed most" = "We gebruiken de opbrengst van je zoekopdrachten om bomen te planten waar ze het meest nodig zijn";
"Websites will always open with Ecosia, planting even more trees" = "Websites worden altijd geopend met Ecosia, waardoor er nog meer bomen geplant worden";
"You need around 45 searches to plant a tree. Keep going!" = "Je hebt ongeveer 45 zoekopdrachten nodig om een boom te planten. Ga door!";
"Help us improve our new app" = "Help ons om onze nieuwe app te verbeteren";
"Let us know what you like, dislike, and want to see in the future." = "Laat ons weten wat je goed vindt, wat je niet goed vindt en wat je nog mist.";
"Share your feedback" = "Deel jouw feedback";
"Sit tight, we are getting ready for you…" = "Nog even geduld, we zijn bijna klaar...";
"We hit a glitch" = "Er is een probleem";
"We are momentarily unable to load all of your settings." = "We kunnen op het moment niet al je instellingen laden.";
"Continue" = "Doorgaan";
"Welcome to the new Ecosia app!" = "Welkom bij de nieuwe Ecosia-app!";
"We've done some re-arranging to make it easier for you to browse the web and plant trees with Ecosia." = "We hebben het een en ander opnieuw ingedeeld, zodat je gemakkelijker op internet kunt surfen en bomen kunt planten met Ecosia.";
"Take a look" = "Neem maar eens een kijkje";
"Set Ecosia as default browser" = "Ecosia instellen als standaard browser";
"Links from websites, emails or messages will automatically open in Ecosia." = "Links van websites, e-mails of berichten worden automatisch geopend in Ecosia.";
"Show Top Sites" = "Belangrijkste sites tonen";
